src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Номенклатура/Forms/ФормаСозданияЦены/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(_, __)
    ЭтотОбъект.ДатаНачалаДействияЦены = НачалоДня(ТекущаяДатаСеанса());
    ЭтотОбъект.Номенклатура = Параметры.Номенклатура;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаписатьНаСервере()
    наборЗаписейРегистра = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
    наборЗаписейРегистра.Отбор.Номенклатура.Установить(Номенклатура);
    наборЗаписейРегистра.Отбор.ВидЦены.Установить(ВидЦены);
    наборЗаписейРегистра.Отбор.Период.Установить(ДатаНачалаДействияЦены);

    наборЗаписейРегистра.Прочитать();
    Если наборЗаписейРегистра.Количество() Тогда
        наборЗаписейРегистра[0].Цена = Цена;

    Иначе
        новаяЗаписьЦены = наборЗаписейРегистра.Добавить();
        новаяЗаписьЦены.Номенклатура = Номенклатура;
        новаяЗаписьЦены.ВидЦены = ВидЦены;
        новаяЗаписьЦены.Период = ДатаНачалаДействияЦены;
        новаяЗаписьЦены.Цена = Цена;
    КонецЕсли;

    наборЗаписейРегистра.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Записать(_)
    ценаНаДату = РаботаСЦенамиВызовСервера.ПолучитьЦенуНаКонкретнуюДату(
            ЭтотОбъект.Номенклатура, ЭтотОбъект.ВидЦены, ЭтотОбъект.ДатаНачалаДействияЦены);
    Если ценаНаДату <> Неопределено Тогда

        текстВопроса = СтрШаблон("На указанную дату уже имеется введенная цена %1, вы действительно хотите изменить цену?", ценаНаДату);
        оповещение = Новый ОписаниеОповещения("_послеОтветаНаВопросОбИзмененииЦены_ОВ", ЭтотОбъект);
        ПоказатьВопрос(оповещение, текстВопроса, РежимДиалогаВопрос.ДаНет, , , "Внимание!");
    Иначе
        записатьИЗакрыть();

    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура записатьИЗакрыть()
    ЗаписатьНаСервере();
    Закрыть();
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура _послеОтветаНаВопросОбИзмененииЦены_ОВ(результатДиалога, __) Экспорт
    Если результатДиалога = КодВозвратаДиалога.Да Тогда
        записатьИЗакрыть();
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
